// task3_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    int d1, m1, y1, d2, m2, y2;

    std::cout << "input start time (dd:mm:yyyy)\n";
    std::cin >> d1 >> m1 >> y1;


    std::cout << "input finish time(dd:mm:yyyy)\n";
    std::cin >> d2 >> m2>> y2;

    int days = 0;
    int years = y2 - y1;
    int month[12] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
    //считаем дни, если номер года не изменился
    if (years == 0) {
        if (((y1 % 4 == 0 && y1 % 100 != 0) || (y1 % 400 == 0)) && (m1 < 3) && ((m2 >= 3) || (m2 == 2) && (d2 == 29))) {
            days += 1;
        }
        for (int i = m1; i < m2; ++i) {
            days += month[i - 1];
        }
        days = days - d1 + d2;
    } //рассматриваем случаи, когда номер года 2 отличен от года 1
    else {
        //считаем дни, которые приходятся на первый год
        for (int i = m1; i <= 12; ++i) {
            days += month[i - 1];
        }
        if (((y1 % 4 == 0 && y1 % 100 != 0) || (y1 % 400 == 0)) && (m1 < 3)) {
            days += 1;
        }
        days -= d1;
         //считаем дни в "целых" годах
        if (years > 1) {
            for (int k = 1; k < years; ++k) {
                days += 365;
                if (((y1 + k) % 4 == 0 && (y1 + k) % 100 != 0) || ((y1 + k) % 400 == 0)) {
                    days += 1;
                }
            }
            if ((y1 % 4 == 0 && y1 % 100 != 0) || (y1 % 400 == 0)) {
                days += 1;
            }

            //считаем дни, которые приходятся на последний год 
            for (int i = 1; i < m2; ++i) {
                days += month[i - 1];
            }
            if (((y1 % 4 == 0 && y1 % 100 != 0) || (y1 % 400 == 0)) && ((m2 >= 3) || (m2 == 2) && (d2 == 29))) {
                days += 1;
            }
            days += d2;
        }
    }

    std::cout << "delta days : " << days << " \n";
}

